АлогистикТест2/src/Documents/алк_ОтгрузкаЩепы/алк_ОтгрузкаЩепы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ОтгрузкаЩепы</name>
  <registerRecords>AccumulationRegister.алк_ПередачиСобственныеСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_УчетВременныхДеклараций</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическийЦентрОтправитель</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическийЦентрПолучатель</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьВ_ТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКУчету_ТД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВременнаяДекларация</name>
    <type>
      <types>DocumentRef.алк_ВременныеТаможенныеДекларации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Теплоход</name>
    <type>
      <types>CatalogRef.алк_Теплоходы</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ОтгрузкаЩепы/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);  
	
	УчастокПриИзмененииНаСервере();
		
КонецПроцедуры


#КонецОбласти 


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗапасыВесНеттоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	//РфпРаботаСДокументами.ПересчитатьОбъемСтрокиПоВесу(СтрокаТабличнойЧасти);
	
	ПересчитатьПлотность(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтрокиПоВесу(СтрокаТабличнойЧасти);
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 


Процедура Конец()
КонецПроцедуры


// Нач мод [Пакушев И.С.] [24.04.2018] 
// Обращение № [0000089575] [ТекстЗаявки]
// Было
// Стало

&НаКлиенте
Процедура ЗапасыОбъемТаможняПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	ПересчитатьПлотность(СтрокаТабличнойЧасти); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ПересчитатьПлотность(СтрокаТабличнойЧасти)  
	
	Если СтрокаТабличнойЧасти.ОбъемТаможня = 0 Тогда		
		СтрокаТабличнойЧасти.Плотность = 0;
	Иначе
		СтрокаТабличнойЧасти.Плотность = СтрокаТабличнойЧасти.ВесНетто * 1000/СтрокаТабличнойЧасти.ОбъемТаможня; 	
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПлотностьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;

	Если СтрокаТабличнойЧасти.Плотность = 0 Тогда		
		СтрокаТабличнойЧасти.ОбъемТаможня = 0;
	Иначе
		СтрокаТабличнойЧасти.ОбъемТаможня = СтрокаТабличнойЧасти.ВесНетто * 1000/СтрокаТабличнойЧасти.Плотность; 	
	КонецЕсли;	 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		
		ПересчитатьПлотность(СтрокаТабличнойЧасти);	
	
	КонецЦикла; 
	
КонецПроцедуры

// Кон мод [Пакушев И.С.] [24.04.2018]

&НаСервере
Процедура ЗаполнитьУсловияПоставкиНаСервере()
	
	Объект.УсловияПоставки = Объект.Заказ.УсловияПоставки.Описание;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУсловияПоставки(Команда)
	ЗаполнитьУсловияПоставкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);

КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры
